src/Catalogs/ТехнологическиеЖурналыШаблоны/ТехнологическиеЖурналыШаблоны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТехнологическиеЖурналыШаблоны</name>
  <predefined>
    <items>
      <name>ATTN</name>
      <description>ATTN</description>
    </items>
    <items>
      <name>CALL</name>
      <description>CALL</description>
    </items>
    <items>
      <name>CONN</name>
      <description>CONN</description>
    </items>
    <items>
      <name>DataBaseException</name>
      <description>DataBaseException</description>
    </items>
    <items>
      <name>DB</name>
      <description>DB</description>
    </items>
    <items>
      <name>DUMP</name>
      <description>DUMP</description>
    </items>
    <items>
      <name>EXCP</name>
      <description>EXCP</description>
    </items>
    <items>
      <name>PROC</name>
      <description>PROC</description>
    </items>
    <items>
      <name>RetExcp</name>
      <description>RetExcp</description>
    </items>
    <items>
      <name>SDBL</name>
      <description>SDBL</description>
    </items>
    <items>
      <name>SESN</name>
      <description>SESN</description>
    </items>
    <items>
      <name>TLOCK</name>
      <description>TLOCK</description>
    </items>
    <items>
      <name>TDEADLOCK</name>
      <description>Tlockerr</description>
    </items>
  </predefined>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ТехнологическиеЖурналы/ТехнологическиеЖурналы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТехнологическиеЖурналы</name>
  <attributes>
    <name>КаталогНастройкиТЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогЛогов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Настройка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийСервер</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогЛоговСетевой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйТекстНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеЦКК</name>
    <attributes>
      <name>ПередаватьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийЦКК</name>
      <type>
        <types>CatalogRef.ВнешниеЦКК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШаблоныТЖ</name>
    <attributes>
      <name>ШаблонТЖВыбранный</name>
      <type>
        <types>CatalogRef.ТехнологическиеЖурналыШаблоны</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстШаблона</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ТехнологическиеЖурналыШаблоны/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Перем ОповеститьОЗаписи, ПередЗаписьюВопрос;

&НаСервереБезКонтекста
Функция ЗаполнитьПоШаблонуНаСервере(Ссылка)
	Возврат Справочники.ТехнологическиеЖурналыШаблоны.ПолучитьШаблонПредопределенного(Ссылка);
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	Объект.Шаблон = ЗаполнитьПоШаблонуНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка = Справочники.ТехнологическиеЖурналыШаблоны.ПустаяСсылка() Тогда
		ЭтотОбъект.Элементы.СтраницаТЖ.Видимость = Ложь;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТехнологическиеЖурналыШаблоныТЖ.Ссылка
		|ИЗ
		|	Справочник.ТехнологическиеЖурналы.ШаблоныТЖ КАК ТехнологическиеЖурналыШаблоныТЖ
		|ГДЕ
		|	ТехнологическиеЖурналыШаблоныТЖ.ШаблонТЖВыбранный = &ШаблонТЖВыбранный
		|";
		
		Запрос.УстановитьПараметр("ШаблонТЖВыбранный", Объект.Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			ЭтотОбъект.Элементы.СтраницаТЖ.Видимость = Ложь;
		Иначе
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				НовСтрока = ЭтотОбъект.ТехнологическиеЖурналы.Добавить();
				НовСтрока.Изменить = Ложь;
				НовСтрока.ТехнологическийЖурнал = Выборка.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ЭтотОбъект.Элементы.ФормаЗаполнитьПоШаблону.Видимость = Объект.Ссылка.Предопределенный;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого ТекДанные Из ЭтотОбъект.ТехнологическиеЖурналы Цикл
		Если ТекДанные.Изменить Тогда
			ТЖОбъект = ТекДанные.ТехнологическийЖурнал.ПолучитьОбъект();
			ТЖОбъект.ИзменитьШаблон(Объект.Ссылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если ОповеститьОЗаписи Тогда
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Ссылка", Объект.Ссылка);
		ПараметрыОповещения.Вставить("Шаблон", Объект.Шаблон);
		Оповестить("ТехнологическийЖурналШаблонЗаписан", ПараметрыОповещения, ЭтотОбъект); 
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("Закрыть") И ПараметрыЗаписи.Закрыть Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОповеститьОЗаписи = Ложь;
	
	Если ЭтотОбъект.ТехнологическиеЖурналы.Количество() > 0 Тогда
		ВсегоОтмечено = 0;
		Для Каждого ТекТЖ Из ЭтотОбъект.ТехнологическиеЖурналы Цикл
			Если ТекТЖ.Изменить Тогда
				ВсегоОтмечено = ВсегоОтмечено + 1;
			КонецЕсли;
		КонецЦикла;
		
		Если ВсегоОтмечено = 0 Тогда
			Если ПередЗаписьюВопрос <> Истина Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект, ПараметрыЗаписи);
				ПоказатьВопрос(ОписаниеОповещения, "Применить шаблон к технологическим журналам?", РежимДиалогаВопрос.ДаНетОтмена);
				Отказ = Истина;
			Иначе
				ПередЗаписьюВопрос = Неопределено;
			КонецЕсли;
		Иначе
			ОповеститьОЗаписи = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ПередЗаписьюВопрос = Истина;
		Записать(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Записать(Новый Структура("Закрыть", Истина));
КонецПроцедуры
